src/cf/src/Documents/КоммерческоеПредложение/КоммерческоеПредложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоммерческоеПредложение</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКоммерческихПредложений</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <comment>Номер последней отправленной клиенту редакции; 0 - ещё не отправлялось. Пересчитывается из регистра редакций при каждой записи</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененоПослеРедакции</name>
    <comment>Содержимое отличается от последней отправленной редакции (черновик правок)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/КоммерческоеПредложение/Forms/ФормаРедакции/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Отправленная редакция коммерческого предложения - только просмотр: показывается её печатная форма из снимка
	// регистра редакций, то есть ровно то, что ушло клиенту (docs/plans/kp-print-revisions.md).
	// Без явных параметров (открытие по ссылке, смок на образце) - последняя редакция предложения из Ключ.
	Предложение = ?(ЗначениеЗаполнено(Параметры.Предложение), Параметры.Предложение, Параметры.Ключ);
	Версия = Параметры.Версия;
	Если ЗначениеЗаполнено(Предложение) И Не ЗначениеЗаполнено(Версия) Тогда
		Редакции = Документы.КоммерческоеПредложение.СписокРедакций(Предложение);
		Версия = ?(Редакции.Количество() = 0, 0, Редакции[0].Версия);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Предложение) Или Не ЗначениеЗаполнено(Версия) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПараметрыПечати = Новый Структура("Версия", Версия);
	Результат = ПечатныеФормы.СформироватьПечатныеФормы("Документ.КоммерческоеПредложение", "КоммерческоеПредложение",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Предложение), ПараметрыПечати);
	Для Каждого ПечатнаяФорма Из Результат.КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(ПечатнаяФорма.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			Документ = ПечатнаяФорма.ТабличныйДокумент;
		КонецЕсли;
	КонецЦикла;
	Документ.ТолькоПросмотр = Истина;
	Элементы.ФормаВернутьРедакцию.Видимость = Параметры.МожноВернуть;
	ШаблонЗаголовка = НСтр("ru = '%1 - редакция v%2 (только просмотр)'; fr = '%1 - révision v%2 (lecture seule)';
		|en = '%1 - revision v%2 (read only)'; es = '%1 - revisión v%2 (solo lectura)'");
	ПредставлениеПредложения = РаботаСДокументами.КраткоеПредставлениеДокумента(Предложение);
	Заголовок = СтрШаблон(ШаблонЗаголовка, ПредставлениеПредложения, Формат(Версия, "ЧГ=0"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	ПараметрыПечати = Новый Структура("Версия", Версия);
	ПечатныеФормыКлиент.ВыполнитьКомандуПечати("Документ.КоммерческоеПредложение", "КоммерческоеПредложение",
		Предложение, ЭтотОбъект, ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьРедакцию(Команда)
	// Содержимое редакции подставляет в себя форма предложения, открывшая эту форму: результат закрытия.
	Закрыть(Новый Структура("ВернутьВерсию", Версия));
КонецПроцедуры

#КонецОбласти
